Tekla.Structures.Drawing.Tools.InputDefinitionFactory
The InputDefinitionFactory class contains helper functions for input definition handling.
using Tekla.Structures.Drawing;
using Tekla.Structures.Drawing.UI;
using Tekla.Structures.Drawing.Tools;
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Plugins;
public class Example
{
public void Example1()
{
var drawingHandler = new DrawingHandler();
Picker picker = drawingHandler.GetPicker();
var pick = picker.PickPoint("Pick a point");
var inputDefinition = InputDefinitionFactory.CreateInputDefinition(pick);
ViewBase myView = InputDefinitionFactory.GetView(inputDefinition);
Point myPoint = InputDefinitionFactory.GetPoint(inputDefinition);
}
}

Tekla.Structures.Drawing.Tools.InputDefinitionFactory.CreateInputDefinition(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point)
Creates a single-point input definition.
view: The view to be used in the input.
point: The point to be used in the input.
Returns: The input definition.

Tekla.Structures.Drawing.Tools.InputDefinitionFactory.CreateInputDefinition(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a two-point input definition.
view: The view to be used in the input.
point1: The first point to be used in the input.
point2: The second point to be used in the input.
Returns: The input definition.

Tekla.Structures.Drawing.Tools.InputDefinitionFactory.CreateInputDefinition(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a three-point input definition.
view: The view to be used in the input.
point1: The first point to be used in the input.
point2: The second point to be used in the input.
point3: The third point to be used in the input.
Returns: The input definition.

Tekla.Structures.Drawing.Tools.InputDefinitionFactory.CreateInputDefinition(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList)
Creates a multi-point input definition.
view: The view to be used in the input.
points: The points to be used in the input.
Returns: The input definition.

Tekla.Structures.Drawing.Tools.InputDefinitionFactory.CreateInputDefinition(System.Tuple{Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.ViewBase})
Creates a single-point input definition.
input: The point and the view to be used in the input.
Returns: The input definition.

Tekla.Structures.Drawing.Tools.InputDefinitionFactory.CreateInputDefinition(System.Tuple{Tekla.Structures.Drawing.PointList,Tekla.Structures.Drawing.ViewBase})
Creates a multi-point input definition.
input: The points and the view to be used in the input.
Returns: The input definition.

Tekla.Structures.Drawing.Tools.InputDefinitionFactory.CreateInputDefinition(System.Tuple{Tekla.Structures.Drawing.DrawingObject,Tekla.Structures.Drawing.ViewBase})
Creates a single-object input definition.
input: The drawing object and the view to be used in the input.
Returns: The input definition.

Tekla.Structures.Drawing.Tools.InputDefinitionFactory.CreateInputDefinition(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.DrawingObject)
Creates a single-object input definition.
view: The view to be used in the input.
drawingObject: The object to be used in the input.
Returns: The input definition.

Tekla.Structures.Drawing.Tools.InputDefinitionFactory.GetView(Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition)
Gets the view that the given input belongs to.
input: The input.
Returns: The view.

Tekla.Structures.Drawing.Tools.InputDefinitionFactory.GetDrawingObject(Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition)
Gets the object from the given single-object input.
input: The input.
Returns: The object.

Tekla.Structures.Drawing.Tools.InputDefinitionFactory.GetPoint(Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition)
Gets the point from the given single-point input.
input: The input.
Returns: The point.

Tekla.Structures.Drawing.Tools.InputDefinitionFactory.GetPoints(Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition)
Gets the points from the given n-point input.
input: The input.
Returns: The points.